src/Documents/ВнПеремОтпуск/ВнПеремОтпуск.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВнПеремОтпуск</name>
  <comment>Аналог документа из ТШК 1С 7.7.</comment>
  <posting>Deny</posting>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>КМ31</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>31</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комплектовщик</name>
      <type>
        <types>CatalogRef.Комплектовщики</types>
      </type>
    </attributes>
    <attributes>
      <name>Короб</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/ШтрихкодыКонтроляОтбора/ШтрихкодыКонтроляОтбора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШтрихкодыКонтроляОтбора</name>
  <resources>
    <name>Документ</name>
    <type>
      <types>DocumentRef.Задание</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Комплектовщик</name>
    <type>
      <types>CatalogRef.Комплектовщики</types>
    </type>
  </resources>
  <resources>
    <name>НомерЗаданияНаОтбор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/ВнПеремОтпуск/ObjectModule.bsl
// @strict-types
#Область ПрограммныйИнтерфейс

// Процедура заполняет табличную часть штрихкодами и записывает изменения.
// 
// Параметры:
//  Задание - ДокументСсылка.Задание
Процедура ЗаполнитьШтрихкодамиЗадания(Знач Задание) Экспорт

    Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
                          |    ВсеШтрихкоды.Штрихкод,
                          |    ВсеШтрихкоды.Комплектовщик
                          |ИЗ
                          |    РегистрСведений.ШтрихкодыКонтроляОтбора КАК ВсеШтрихкоды
                          |ГДЕ
                          |    ВсеШтрихкоды.Документ = &Документ");

    Запрос.УстановитьПараметр("Документ", Задание);
    РезультатЗапроса = Запрос.Выполнить();
    Выборка = РезультатЗапроса.Выбрать();

    // Очистка табличной части
    ТабличнаяЧасть.Очистить();

    Пока Выборка.Следующий() Цикл
        
        //@skip-check property-return-type
        Штрихкод = Выборка.Штрихкод; // Строка
        
        //@skip-check property-return-type
        Комплектовщик = Выборка.Комплектовщик; // СправочникСсылка.Комплектовщики
        
        // Определение типа штрихкода
        Тип = ШтрихкодыОбувиКлиентСервер.ТипШтрихкода(Штрихкод);

        // Запись в журнал ошибок в зависимости от типа штрихкода
        Если Тип = Перечисления.ТипШтрихкода.НомерКороба Тогда

            ДобавитьНомерКороба(Штрихкод, Комплектовщик);

        ИначеЕсли Тип = Перечисления.ТипШтрихкода.КодМаркировки Тогда

            ДобавитьКодМаркировки(Штрихкод, Комплектовщик);

        КонецЕсли;

    КонецЦикла;

    Записать();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура добавляет новую строку и заполняет реквизит "Короб".
// 
// Параметры:
//  НомерКороба - Строка
//  Комплектовщик - СправочникСсылка.Комплектовщики
Процедура ДобавитьНомерКороба(Знач НомерКороба, Знач Комплектовщик)

    НоваяСтрока = ТабличнаяЧасть.Добавить();
    НоваяСтрока.Короб = НомерКороба;
    НоваяСтрока.Комплектовщик = Комплектовщик;

КонецПроцедуры

// Процедура добавляет новую строку и заполняет реквизит "КМ31".
// 
// Параметры:
//  КодМаркировки - Строка
//  Комплектовщик - СправочникСсылка.Комплектовщики
Процедура ДобавитьКодМаркировки(Знач КодМаркировки, Знач Комплектовщик)

    НоваяСтрока = ТабличнаяЧасть.Добавить();
    НоваяСтрока.КМ31 = КодМаркировки;
    НоваяСтрока.Комплектовщик = Комплектовщик;

КонецПроцедуры

#КонецОбласти
